# 1. Перевод числа из десятичной системы в двоичную.
# Перевести десятичное число 15 в двоичную систему
# Перевести десятичное число 27 в двоичную систему
# Перевести десятичное число 73 в двоичную систему
# Перевести десятичное число 105 в двоичную систему


1111, 11011, 1001001, 1101001


# 2. Перевод числа из двоичной системы в десятичную.
# Перевести двоичное число 111 в десятичную систему
# Перевести двоичное число 10101 в десятичную систему
# Перевести двоичное число 11011 в десятичную систему
# Перевести двоичное число 110101011 в десятичную систему


7, 21, 27, 427