import math
import re

# 1. Есть три целочисленные переменные, нужно посчитать:
# сумму
# разность
# произведение
# от первой переменной отнять вторую и прибавить третью
# поделить произведение двух переменных на третью
# от суммы первых двух переменных найти остаток от деления на третью переменную
a = 25; b = 13; c = 4

d = a + b + c
print(d)
e = a - b - c
print(e)
f = a * b * c
print(f)
g = (a - b) + c
print(g)
h = (a * b) / c
print(h)
k = (a + b) % c
print(k)


# 2. Дан прямоугольный треугольник с катетами cat_a и cat_b.
# Найти площадь треугольника и его гипотенузу.
cat_1 = input('a = ')
cat_2 = input('b = ')

cat_1 = float(a)
cat_2 = float(b)

area = (a * b) / 2
c = math.sqrt(a**2 + b**2)
perimeter = a + b + c

print('Area: ', area)
print('Perimeter: ', round(perimeter, 2))


# 3.Дана строка, состоящая из слов, разделенных пробелами.
# (Вот 4 варианта тестовых данных для программы:
# ‘Hello world’, ‘a b c’, ‘test’, ‘test1 test2 test3 test4 test5’).
# Определите, сколько в ней слов.


text = ('‘Hello world’, ‘a b c’, ‘test’, ‘test1 test2 test3 test4 test5’')
text = re.sub(r'[^\w\s]', '', text.lower())
text = len([word for word in text.split() if word])
print(text)


# 4. Дана строка. Замените в этой строке все появления буквы h на букву H,
# кроме первого и последнего вхождения. Подсказка: использовать метод replace
# с параметрами. Например, дано: ‘hhhabchghhh’, должно быть: ‘hHHabcHgHHh’

s = ('hhhabchghhh')
a = s[:s.find('h') + 1]
b = s[s.find('h') + 1:s.rfind('h')]
c = s[s.rfind('h'):]
s = a + b.replace('h', 'H') + c
print(s)


# 5. Дана строка.
# 1 Сначала выведите третий символ этой строки.
# 2 Во второй строке выведите предпоследний символ строки.
# 3 В третьей строке выведите первые пять символов строки.
# 4 В четвертой выведите всю до последних двух символов.
# 5 В пятой строке выведите все символы с четными индексами
# (считая, что индексация начинается с 0, поэтому символы выводятся начиная с первого).
# 6 В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
# 7 В седьмой строке выведите все символы в обратном порядке.
# 8 В восьмой строке выведите все символы строки через один в обратном порядке,
# начиная с последнего.
# 9 В девятой строке выведите длину данной строки.

string_2 = 'AaBbCcDdEeFfGgHhIiJjKkLlMmNn'
print(string_2[2])
print(string_2[-2])
print(string_2[:5])
print(string_2[:-2])
print(string_2[::2])
print(string_2[1::2])
print(string_2[::-1])
print(string_2[::-2])
print(len(string_2))


# Тестовые данные для 5 задачи:
# строка ‘Hello’, должно быть:
# l
# l
# Hello
# Hel
# Hlo
# el
# olleH
# olH
# 5

wert = 'Hello'
print(wert[2])
print(wert[3])
print(wert[:5])
print(wert[:3])
print(wert[::2])
print(wert[1:3])
print(wert[::-1])
print(wert[::-1])
print(wert[::-2])
print(len(wert))


# Дано целое число. Выведите его последнюю цифру.
# Например, дано 200 - последняя цифра 0. Дано 123 - последняя цифра 3. Дано 587 - последняя 7.
a = 200
b = 123
c = 587

print(a % 10)
print(b % 10)
print(c % 10)


# 7. Дано трехзначное число, найти количество его десятков. Например, дано 123 – количество десятков: 2,
# дано 978 – количество десятков: 7.
a = 123
b = 978
print(a // 10 % 10)
print(b // 10 % 10)


# 8. Дано трехзначное число, найти сумму его цифр. Например, дано 123 – сумма 6, дано 555, сумма 15.
a = 123 // 100
b = 123 // 10 % 10
c = 123 % 10
print(a + b + c)

d = 555 // 100
e = 555 // 10 % 10
f = 555 % 10
print(d + e + f)











